7zip
alsa-firmware
base
base-devel
bash-language-server
biber
bluez
bluez-utils
chafa
ctags
discord
dkms
efibootmgr
fcitx5
fcitx5-configtool
fcitx5-gtk
fcitx5-qt
fcitx5-unikey
fd
file-roller
fish
fzf
ghostscript
git
github-cli
grim
grub
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-good
gst-plugins-ugly
gvfs
htop
hyprland
igraph
imagemagick
intel-media-driver
intel-ucode
iwd
java-runtime-common
jdk-openjdk
kitty
lazygit
libpulse
libreoffice-fresh
libva-nvidia-driver
linux
linux-firmware
linux-headers
lua-language-server
lutris
mermaid-cli
mpv
neovim
networkmanager
ninja
noto-fonts-emoji
nvidia-open-dkms
ollama-cuda
pacman-contrib
pandoc-cli
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
polkit-kde-agent
power-profiles-daemon
pyright
python-pip
python-pynvim
qt5-graphicaleffects
qt5-multimedia
qt5-quickcontrols2
qt5-wayland
qt6-5compat
qt6-multimedia
qt6-multimedia-ffmpeg
qt6-wayland
r
ripgrep
ruff
sddm
slurp
smartmontools
sof-firmware
speech-dispatcher
steam
sudo
texlive-binextra
texlive-latexextra
thunar
tree-sitter-cli
tumbler
ueberzugpp
uwsm
viu
vulkan-intel
wdisplays
wget
wireless_tools
wireplumber
wofi
wpa_supplicant
xdg-desktop-portal-hyprland
xdg-utils
xorg-server
xorg-xinit
yaml-language-server
yazi
zram-generator
